{ElGamal椭圆曲线公钥密码计算. 设y2=x3+x+6是Z11上的椭圆曲线, 椭圆曲线上一个点为P = (2,7), 假设Alice取的
秘密整数d =3,
当P≠Q,λ=(y2-y1)/(x2-x1),x3=λ2-x1-x2, y3=λ(x1-x3)-y1;
当P=Q,λ=(3x1
2+a)(2y1)-1,y1≠0, Q =2P=(x3, y3), x3=λ2−2x1, y3=λ(x1-x3)-y1;
求公钥Q=3P=(x3, y3).
先计算2P,λ=____,x3=____, y3=____;再求3P,λ=____,x3=____, y3=____,(x3, y3).为公钥。}
(1) 8 (2) 5 (3) 2 (4) 2 (5) 8 (6) 3

1.(计算题，10.0分)(ElGamal椭圆曲线公钥密码计算 y^2=x^3+x+2,是Z11上的椭圆曲线，椭圆曲线上一个点P = (4,2)假设Alice取的秘密整数d=3，当 x^2=23=1(mol1)
当 7=4⋅1+3,x^2=2(mod7)求公钥 dT):3P= x^2=1(mol1)x3,y3).先计算2P mc
再求3P， m=7⋅11,M_1=11,M_1^'=(┤),M_2=7,M_2^'=(┤)为公钥.）
(1) 4 (2) 8 (3) 4 (4) 6 (5) 2 (6) 10
