Alice从密文求解拉宾公钥的明文。 x2≡ 23 (mod 77) ，这里23为密文。解 令 n=p•q=7•11=77，因为C≡m2(modn) 即  x2
≡23 (mod77)，因为7=8h±1, 2是模7的平方剩余，1是平方剩余，所以都有解。而 7=4•1+3，x2≡2 (mod7)的解为 x≡±( )≡b1
(mod7)11=4•2+3 ，x2≡1 (mod11)的解为 x≡±( )≡b2(mod11) 求x2≡23 (mod77)的解可用用孙子定理求同余式组x≡b1(mod7)，x≡b2
(mod11)m=7•11,M1=11，M1’=( ), M2=7, M2’=8,x≡b1•( )+b27•8 (mod77) 共有4组解m1≡4•22-1•21≡67(mod77) m2≡4•22+1•21≡32(mod77)
m3≡-4•22-1•21≡45(mod77) m4≡-4•22+1•21≡10(mod77
(1) 4；3 (2) 1 (3) 2 (4) 22

求解拉宾密码的明文 x^2=23(mod77),这里23为密文。
解令n=p*q=7·11=77，已知C=m²modap) x^2=23(mol/7)
先求解 x^2=23=2(mol7)和 x^2=23=1(mol11)
因为7=8h±1，2是模7的平方剩余，1是平方剩余，所以都有解。
而 7=4⋅1+3,x^2=2(mod7)的解为x=ta()=b(mo dT)
11-4·2+3, x^2=1(mol1)的解为x=±1-b2(mod/l)
求x23(mod77)）的解可用用孙子定理求同余式组
x=bj(mod7),x=b2( mcd11)
 m=7⋅11,M_1=11,M_1^'=(┤),M_2=7,M_2^'=(┤)
 x=b_1⋅22+b_2⋅(┤)(mol7)共有4组解
 m_1=67(mol7) m_2=32(mol7)
 m_3=45(mol7) m_4=10(mol7)
(1) 4; 3 (2) 2 (3) 8 (4) 56
